@echo off
@chcp 65001 > nul
echo =============================================

echo 自动监听并编译ts文件

echo 你可以直接关闭命令行窗口中断工作XD

echo =============================================

echo 更推荐使用 VSCode 等IDE来托管编译事宜

echo =============================================

echo 编译后的JS文件将出现在 dist 文件夹

echo =============================================

echo 你需要先安装ts才能编译ts

echo 安装指令（需要NodeJS）：npm install -g typescript

echo =============================================

tsc -p tsconfig.json --watch